# 1)შექმენით 10 ელემენტიანი სია, და ამ სიიდან ბოლო 5 ელემენტი გამოიტანეთ დადებითი სლაისინგით
list_1 = [1,2,3,4,5,6,7,8,9,10]
print(list_1[5:10])
# 2)შექმენით 20 ელემენტიანი სია, და ამ სიიდან პირველი 11 ელემენტი გამოიტანეთ ყაროფიტითი ინდექსებით
list_2 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
print(list_2[-20:-9])
# 3)შექმენით 12 ელემენტიანი სია, და მომხარებელს შემოატანინე რიცხვი, შემდეგ 2 იდან მომხარებლის შემოტანილ რიცხვამდე გამოიტანე ყველა ელემენტი
list_3 = [1,2,3,4,5,6,7,8,9,10,11,12]
user_inp = int(input("enter any number 1-12: "))
print(f"from 2 index to usr_inp ინდექსამდე ელემენტებია : {list_3[2:user_inp]} ")


list_4 = [1,2,3,4,5,6,7,8,9]
user_inp1 = int(input("enter any number 1-9: "))
print(f"your new index is {list_4[2:user_inp1]}")