#1)ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი,5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True
print(10==10 and 10>5)
print(15==15 and 30>10)
print(50==50 and 30>20)
print(20==20 and 10>30)
print(12==12 and 25>100)
print(9==9 and 30 >32)

print(10==10 or 15<10)
print(12==12 or 20>100)
print(30==30 or 15>20)
print(30==50 or 70<2)
print(30==13 or 50>120)
print(20==60 or 10<5)

#2)კომენტარის სახით დაწერეთ თუ რა არის sequancing,iteration,selection აღწერე თითეული მათგანი თქვენი სიტყვებით
# control flow 
#iteration - ეს არის განმეორება ანუ იგივე loop მაგალითად 1,2,3,4,1,2,3,4,1,2,3,4.... ესე უსასრულობამდე
#sequencing - ეს არის იგივე თანმიმდევრულად დაყოფა
#selecting - (არჩევითი) ანუ სიტყვისა თუ სიმბოლის არჩევა 

#3)მოიყვანე secuencing ის მაგალითი,და კომენტარით მიუწერე რატომ არის შენს მიერ მოყვანილი მაგალითი sequence
print ("sketch of the building")
print ("start building")
print ("finish building")
print ("congradulations you have built a building"  )
# ეს იყო sequiencing ის კარგი მაგალიტი რადგან პირნათლად ჩანს შენობის აშენების ნაბიჯები ზემოდან ქვემოთ როგორც კოდი იკითხება

#4)კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის~
# For loop - ეს არის ფუნქცია რომელსაც შეუძლია რაღაცის გამეორება ჩვენი მითითებული რაოდენობის მიხედვით იგი გვეხმარება დროის დაზოგვაში 

#5)კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop
#range() - ეს არის ფუნქცია რომელიც ფარგლებს აღნიშნავს მაგ range(10) ანუ 0 იდან 9 დე 10 სიმბოლო 
#range() - For loop ში კი მითითებული მნიშვნელობის გარკვეული რაოდენობით განმეორებისთვის არის საჭირო 

#6)შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop
for i in range(1):
    print("BMW m5 c")
#7)შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ
for i in range(100):
    print("qusikashvili")
#8)შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ
for i in range(46):
    print("midnight blue")
#9)შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ
for i in range(32):
    print("N")
# გამეორება

#10)მომხმარებელს შემოატანინე 3 სტრინგ ტიპის და ერთი ინტეჯერ ტიპის მნიშვნელობები და შენი დავალებაა მოახდინო ამ ოთხი მნიშვნელობის კონკატინაცია(გამოიყენე შესაბამისი ფუნქცია რომ მოახდინოთ მონაცემთა ტიპიების გარდაქმნა ერთ მონაცემთა ტიპში რომ შეძლოთ კონკატინაცია)
name = (input("Enter your name"))
age =(input("Enter your age"))
surname = (input("Enter your surname"))
nickname = (input("Enter your nickname"))
print(name + age + surname + nickname )

#11)შექმენი 4 ცვლადი,თითოეულში შეინახე განსხვავებული მონაცემთა ტიპები,შენი დავალებაა გაიგო ამ ცვლადებში შენახული მნიშვნელობის მონაცემთა ტიპი(გამოიყენე შესაბამისი ფუნქცია)
name_1 = "Nikolozi"
age_1 = 15
height_1 = 1.80
info = True
print(type(name_1))
print(type(age_1))
print(type(height_1))
print(type(info))

#12)მომხმარებელს შემოატანინე 4 რიცხვი და ტერმინალში დააბრუნე ამ 4 რიცხვის ჯამი
num_1 = int(input("Enter any number"))
num_2 = int(input("Enter any number"))
num_3 = int(input("Enter any number"))
num_4 = int(input("Enter any number"))
print(num_1 + num_2 + num_3 + num_4)

