 
# 1) შექმენით 10 ელემენტიანი სია. სლაისინგის დახმარებით (დადებითი ინდექსებით):
# --> გამოიტანეთ პირველი 5 ელემენტი
# --> გამოიტანეთ ბოლო 3 ელემენტი
# --> გამოიტანეთ ელემენტები 3 ინდექსიდან 7 ინდექსის ჩათვლით
list = [1,2,4,5,6,7,8,9,10]
print(list[:5])
print(list[6:])
print(list[3:7])

# 2) შექმენით 15 ელემენტიანი სია. სლაისების დახმარებით (უარყოფითი ინდექსებით):
# --> გამოიტანეთ პირველი 6 ელემენტი
# --> გამოიტანეთ ბოლო 10 ელემენტი
# --> გამოიტანეთ ელემენტები 7 ინდექსიდან 14 ინდექსის ჩათვლით (გონებაში გადაიყვანეთ უარყოფით ინდექსებში)
list_1 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
print(list_1[:-9])
print(list_1[-10:])
print(list_1[7:14])
# 3) მოცემულია სიტვა 'თვითმფრინავი'
# გამოიტანეთ 'ნავი'
word = "თვითმფრინავი"
print(word[8:12])
# 4) მოცემულია სიტყვა 'Programmer'. სლაისინგის დახმარებით:
# --> გამოიტანეთ 'Pro' დადებითი და უარყოფითი ინდექსებით
word_1 = 'Programmer'
print(word_1[:3] )
print(word_1[:-7])

# 5) შექმენით სია სადაც შეინახავთ კვირის დღეების სახელებს. სლაისინგის დახმარებით:
# --> გამოიტანეთ სამუშაო დღეები (დადებითი და უარყოფითი ინდექსებით)
# --> გამოიტანეთ დასვენების დღეები (დადებითი და უარყოფითი ინდექსებით)
days = ["monday","tuesday","wendsday","thurstday","friday","saturday","sunday"]
print(days[:5])
print(days[:-2])
print(days[5:])
print(days[-2:])
# 6) მოცემულია წინადადება: 'Python slicing is very powerful'. სლაისინგის გამოყენებით ->
# გამოიტანეთ: 
# 'Python'
# 'slicing'
# 'powerful'
# გამოიყენეთ როგორც დადებითი ასევე უარყოფითი ინდექსები
word_2 = 'Python slicing is very powerful'
print(word_2[:6])
print(word_2[6:15])
print(word_2[23:31])
print(word_2[:-24])
print(word_2[-24:-17])
print(word_2[-8:])