# #1)შექმენით სია საცად მოათავსებტ 7 ადამიანის სახელს,თქვენი დავალებაა რომ ტერმინალში გამოიტანოთ ყველა ელემენტი ცალ ცალკე მინუს ინდექსებით

# 2)შექმენით 5 ცვლადი და შეინახეთეთ მათში სახელები,თქვენი დავალებაა რომ შეადგინოთ სია ამ ცვლადების გამოყენებით(გამოიყენეთ რათქმაუნდა ცვლადის სახელები),სიის შექმნის შემდეგ გამოიტანეთ ტერმინალში სიაში მყოფი ბოლო ელემენტი(გამოიყენეთ მინუს ინდექსები

#1 
names = ["vaxo","lasha","nika","daviti","goga","avto","toko"]
print(names[-1])
print(names[-2])
print(names[-3])
print(names[-4])
print(names[-5])
print(names[-6])
print(names[-7])

car_1 = "mercedes"
car_2 = "audi"
car_3 = "bmw"
car_4 = "citroen"
car_5 = "nissan"

all_cars = [car_1,car_2,car_3,car_4,car_5]
print(all_cars[-1])

#3)შექმენით ცვლადი და შეინახეთ მნიშვნელობა "irakli" თქვენი დავალებაა რომ ინ=დექსინგის გამოყენებით ტერმინალში გამოიტანოთ ასო ბგერა K როგორც დადებით ასევე უარყოფითი ინდექსიტ
name = "irakli"
print(name[3])
print(name[-3])


letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]
# დაბეჭდეთ მესამე ასო.
print(letters[4])
# დაბეჭდეთ მე–5 და მე–6 ასო.
print(letters[6] and letters[7])
# დაბეჭდეთ ბოლო ასო.
print(letters[-1])
# ააწყეთ სიტყვა "მამა" ინდექსებით (ყველა ასო ინდექსით უნდა აიღონ და შეაერთონ).
print((letters[6] + letters[0] + letters[6] + letters[0]))
# ააწყეთ სიტყვა "გოლა".
print((letters[2] + letters[3] + letters[4] + letters[0]))

# ააწყვეთ სიტყვა "გოგა"
print((letters[2] + letters[3] + letters[2] + letters[0]))