
# print(vegetables)
# 1)კომენტარის სახით ახსენით თუ რა არის index და რაში ვიყენებთ მას
# python - ში სიის ელემენტებს აქვთ თავიანთი მისამართი და ამ მისამართებს ეწოდებათ ინდექსი

# 2)შექმენით ცვლადი სადაც შეინახავთ ამ სიას [4,6,1,5,9,8,4] ,თქვენი დავალებაა რომ მიწვდეთ ამ სიაში ელემენტებს ინდექსინგის გამოყენებით ,შეკრიბეთ ორი რიცხვი რომ მიიღთ შემდეგი რიცხვები --> 10 , 2 , 14 , 20 , 4 , 7 , 27 , გამოიყენეთ მათემატიკური ოპერატოები
var = [4,6,1,5,9,8,4]
print(var[1]+var[0])
print(var[2]+var[2])
print(var[3]+var[4])
print(var[4]+var[3]+var[1])
print(var[4]+var[3]+var[1]+var[1]+var[2])
print(var[0])
print(var[1]+var[2])
# 3)შექმენით სია სადაც შეიყვანთ ადამიანის სახელებს,უნდა გქონდეთ სულ 10 სახელი,თქვენი დავალებაა რომ გამოიტანოტ ,მე 5 , მე 9 ,მე 3 ,მე 7 და პირველ ინდექსზე მდგომი ელემენტები ცალ ცალკე,გამოიყენეთ ინდექსინგი
names = ["vaxo","dato","luka","toko","avto","lasha","nika","gio","saba","mamuka"]
names [5]
names [9]
names [3]
names [7] 
# 4)შექმენით სია სადაც მოათავსებთ სტრინგ ტიპის მონაცემებს,თქვენი დავალებაა გომ for loop და while loop (ორივე) ს დახმარებით გამოიტანოთ თთოეული ელემენტი ცალ ცალკე
box=["goga","lasha","andria","dato","nikolozi","avto","toko","vaxo","saba","luka"]
for i in range(10):
    print(box[i])
i = 0
while i < 7:
    print(box[i])
    i += 1
# , სევე შეცვალე მე 6 ინდექსზე მდგომი ელემენტი და ჩაანა
# 5)შექმენით სია სადაც შეინახავთ 7 ცალ ელემენტს(მონაცემის ტიპს არ აქვს მნიშვნელობა),თქვენი დავალებაა რომ ამ სიაში შეცვალოთ მე 3 ინდექსზე დმგომი ელემენტი და ჩაანაცვლო "vashli" ითცვლე 'msxali' ით ,ასევე შეცვალე მე 4 ინდექსზე მდგომი ელემენტი და ჩაანაცვლე ის 'atami" ით,გამოიტანე საბოლოო სია ტერმინალში,სადაც ეს სალი ელემენტი იქნება განახლებული~
fruits = ["marwyvi","bali","kivi","banani","yurzeni","qliavi","gargari"]

fruits [3] = "vashli"
fruits [4] = "msxali"
fruits [5] = "atami"

print(fruits[3])
print(fruits[4])
print(fruits[5])
# 6)იპოვეთ საბოლოო პასუხი--> True and False or False and True or false and false or true ---> ...
True and False or False and True or False and False or True 
print(True and False or False and True or False and False or True ) # True
# 7)შექმენით სია სადაც მოთავსებული გექნებათ ცხოველების სახელები, თქვენი დავალებაა რომ -->  თუ ამ სიაში მოთავსებული მე 3 ინდექსზე მდგომი ელემენტი არის ლომი მაშნ დაპრინტე --> "there is lion on index 3" სხვა შემთხვევაში დაუპრინტე რომ --> "there is no lion on index 3"
zoo = ["vefxvi","spilo","lomi","niangi","pingvini"]
choise = zoo[2]
if choise == "lomi":
    print("there is lion on index 3")
else:
    print("wrong choice")
# 8)
basket = ["ვაშლი", "ბანანი", "საზამთრო", "ატამი", "ყურძენი"]

# დაბეჭდეთ კალათის პირველი ხილი.
print(basket[0])
# დაბეჭდეთ კალათის მესამე ხილი.
print(basket[3])
# შეცვალეთ მეორე ხილი "ბანანი" სხვა ხილით (თქვენი არჩევანით).
basket [1] =  "ვაშლატამა"
print(basket[1])
# დაბეჭდეთ თავიდან ბოლომდე ყველა ხილი ცალ–ცალკე, ინდექსების გამოყენებით (არა for-ით).
print(basket[0])
print(basket[1])
print(basket[2])
print(basket[3])
print(basket[4])

# 9)
letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]
# დაბეჭდეთ მესამე ასო.
print(letters[4])
# დაბეჭდეთ მე–5 და მე–6 ასო.
print(letters[6] and letters[7])
# დაბეჭდეთ ბოლო ასო.
print(letters[-1])
# ააწყეთ სიტყვა "მამა" ინდექსებით (ყველა ასო ინდექსით უნდა აიღონ და შეაერთონ).
print(str(letters[6] + letters[0] + letters[6] + letters[0]))
# ააწყეთ სიტყვა "გოლა".
print(str(letters[2] + letters[3] + letters[4] + letters[0]))

# ააწყვეთ სიტყვა "გოგა"
print(str(letters[2] + letters[4] + letters[2] + letters[0]))

# 10)
letters1 = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

# აიღეთ მე–4 ინდექსზე არსებული ასო და შეინახე ცვლადში
index_4 = letters1[4]
# თუ ეს ასო არის "ლ", დაბეჭდეთ: "სწორია! ასო ლ ა"
if index_4 == "ლ":
    print("სწორია ეს არის ასო ლ!")
else:
    ("არასწროია")
# სხვა შემთხვევაში დაბეჭდეთ: "არასწორია, სცადე თავიდან"

# =========================
# აიღეთ ბოლო ასო და შეინახე ცვლადში
index_last = letters[-1]
# თუ ეს "ე"–ა, დაბეჭდეთ "საიდუმლო სიტყვა იწყება სწორად".
if index_last == "ე":
    print("სწორია")
else:
    print("საიდუმლო სიტყვა არასწორია!")
# სხვა შემთხვევაში – "საიდუმლო სიტყვა არასწორია".
# ==========================

# ააწყვეთ სიტყვა "გელა" და შეინახე ცვლადში 
name = str(letters[2] + letters[-1] + letters[4] + letters[0])
# თუ ცვლადში შენახული სიტყვა "გელა"–ს ტოლია, დაბეჭდეთ "გაარტყი სახელი!"
if name == "გელა":
    print("სწორია !!!")
else:
    ("შეცდომაა!")
# სხვა შემთხვევაში – "შტერი ხარ!დ".




# 11)შექმენი სია რომელიც იქნება სტრინგებით სავსე,შენი დავალებაა რომ მომხმარებელს შემოატანინო რაიმე რიცხვი,
# შენი დავალებაა რომ ამ სიიდან გამოიტანო მომხმარებლის მიერ შემოტანილ რიცხვზე(ინდექსზე) მდგომი ელემენტი
shop = ["coke","water","bread"]
print("choose any item 0-2")
choice=int(input("choose here"))
if choice ==0:
    print(shop[0])
elif choice == 1:
    print(shop[1])
elif choice == 2:
    print(box(2))
else:
    print("wrong operation!")