# მონაცემთა ტიპები
#1 string-ეს არის ეს არის ბრჭყალებში ჩაწერილი ტექსტური მნიშვნელობა ანუ იგივე სიმბოლო ""
"Georgia"
#2 integer-ეს არის მთელი რიცხვი
10
#3 float - ეს არის ათწილადი რიცხები 
3.5,5.5,8.7,4.3,...
#4 boolean - ეს არის უბრალოდ True და False

# print  ფუნქციის გამოყენება
print("Georgia",10,7.2,True)

# რა არის ცვლადი?-ცვლადი მოიცავს რაღაც (value) ანუ მნიშვნელიბას,ის შეგვიძლია წარმოვიდგინოთ როგორთ ყუთი რომელიც შეიცავს გარკვეული თემატიკის მქონდე იმფორმაციას მაგალითად თემატიკაა Country და იმფორმაცია Georgia იგი იწერება Country ="georgia"

#ცვლადი integer ით 
age=15
#ცვლადი string ით
name="jordan"
#ცვლადი float ით
height=1.80
