# 1) for ციკლით დაბეჭდე რიცხვები 1 დან 50 მდე.  
#    თუ რიცხვი ლუწია -> დაბეჭდე "ლუწი"
#    თუ კენტია -> "კენტი"  
#    ფორმატით:  
#    1 კენტია  
#    2 ლუწია
for number in range(1,51):
    if number  ==0:
        print(" ნული ")
    elif number % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")
    
# 2) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
#    - თუ რიცხვი იყოფა 3-ზე -> "იყოფა 3-ზე"  
#    - თუ რიცხვი იყოფა 5-ზე -> "იყოფა 5-ზე"  
#    - თუ ორივეზე იყოფა -> "იყოფა 3-ზე და 5-ზე" 
#    - სხვაგვარად -> "არ იყოფა არცერთზე"
for number_1 in range(0,20):
    if number_1 % 3 ==0:
        print("იყოფა 3-ზე" )
    elif number_1 % 5 ==0:
        print("იყოფა 5-ზე" )
    elif number_1 % 3 ==0 and number % 5 == 0:
        print("იყოფა 3-ზე და 5-ზე")
    else:
        print("არ იყოფა არცერთზე")
# 3) მომხმარებელს შემოატანინე რიცხვი. 
#    for ციკლით დაითვალე რამდენი ლუწი და რამდენი კენტი რიცხვია დიაპაზონში 0-დან შემოტანილ რიცხვამდე.  
#    დაბეჭდე შედეგი ამ ფორმატით:  
#    ლუწი რიცხვების რაოდენობა: X  
#    კენტი რიცხვების რაოდენობა: Y

inp = int(input("enter any number! "))
x = 0
y = 0
for i in range(inp + 1 ):
    if x % 2 ==0:
        x +=1
    else:
        y += 1 
    

        print(f"ლუწი რიცხვების რაოდენობაა{x}")
        print(f"კენტი რიცხვების რაოდენობა{y}")


# 4) მოცემულია სია -> [10, 25, 33, 47, 80, 99]  
#    for ციკლით დაუარე თითოეულ ელემენტს.  
#    თუ ელემენტი მეტია 50 ზე -> "მეტი 50-ზე" 
#    თუ ნაკლებია 50 ზე -> "ნაკლები 50-ზე".
list_1 = [10, 25, 33, 47, 80, 99]
for i in list_1:
    if i > 50:
        print("more than 50!")
    else:
        print("less than 50!")
# 5) for ციკლით დაბეჭდე ყველა ლუწი რიცხვი 0 დან 100 მდე.  
#    ბოლოს დაბეჭდე -> "ლუწი რიცხვების ჯამია: X".
sum_even = 0
for i in range(0,100,2):
    print(i)
    sum_even +=1
    print("even numbers",sum_even)

# 6) შექმენი სია და შეინახეთ შიგნით სტრინგები  
#    for ციკლით დაბეჭდე მხოლოდ ის სიტყვები, რომლებიც იწყება ასო "a" ზე.
# list = ["avto,dato,aleqsandre,shota,vaxo"]
# for i in list:
#     print() 
# ვერ გავიგე 
# 7) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
#    თუ რიცხვი არის ნული -> "ნულია"  
#    თუ კენტია -> "კენტია"  
#    თუ ლუწია -> "ლუწია".
for i in range(0,20):
    print(i)
    if i ==0:
        print("ნულია!")
    elif i %2 !=0:
        print("კენტია!")
    elif i % 2 ==0:
        print("ლუწია!")
# 8) შექმენი სია -> [5, 15, 25, 35, 45, 55] 
#    for ციკლით დაუარე სიას და დაბეჭდე მხოლოდ ის ელემენტები, რომლებიც იყოფა 5 ზე.
list_2 = [5, 15, 25, 35, 45, 55] 
for i in list_2:
    if i %5 ==0:
        print(i)
    
# 9) მომხმარებელს შემოატანინე სიტყვა.  
#    for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.
name = input("enter your name: ")
for i in name:
    print(i)
# 10) შექმენი ცვლადი -> total = 0  
#     for ციკლით დაამატე 1 დან 10 მდე ყველა რიცხვი total-ში.  
#     ბოლოს დაბეჭდე -> "ჯამი არის: X".
total = 0
for i in range(1,10):
    total = total + 1 
    print("ჯამი არის",total)
