#1)მოიყვანეთ აბსოლიტურად ყველა მათემატიკურ  ოპერატორზე სამ სამი მაგალითი ძველებზეც და ახლებზეც
print(15+15)
print(13.25+34.5)
print("vaxo"+"jemala")

print(20-14)
print(35.6-12)
print(123 - 32)

print(20 / 5)
print(45.5 / 4)
print(40 / 10)

print(8*8)
print("jambula"*5)
print(14.5*5)

print(100//20)
print(30//5)
print(40//4)

print(2**2)
print(5**7)
print(11**11)

print(10%6)
print(20%10)
print(50%5)
#2)კომენტარის სახით ახსენით თუ რა მათემატიკური ოპერაციები ვისწალეთ დღეს და სიტყვიერად დაწერეთ თუ რას აკეთებენ ისინო
# ჩვენ ვისწავლეთ 3 ახალი მათემატიკური ოპერატორი ესენია // და ** სადაც // აღნიშნავს თუ რამდენჯერ  თავსდება პირველ რიცხვში მეორე რიხცვი რაც შეეხება ** ეს არის ხარისხში რიცხვის აყვანა და % 
# რომელიც გვეუბნება ნაშთს ანუ ის არის ნაშთის ოპერაცია
#3)დღეს ახსნილ მათემატიკურ ოპერატორებზე სათითაოდ მოიყვანეთ ხუთ ხუთი მაგალითი , ანუ სულ 15 მაგალით უნდა გქონდეთ
# //
print(100//20)
print(30//5)
print(40//4)
print(50//5)
print(100//50)
# **
print(2**2)
print(5**7)
print(11**11)
print(11**23)
print(3**3)
# %
print(10%6)
print(20%10)
print(50%5)
print(100%20)
print(400%40)
#4)ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:

    #  15 / 3 = 5
    #  20 / 4 =  5 
    #  100 / 20 = 5

    #  15 // 10 = 5
    #  10 // 7 = 3
    #  40 // 12 =  4

    #  4 * 3 = 12
    #  40 * 3 = 120
    #  120 * 3 = 360

    #  4 ** 3 = 64
    #  10 ** 3 =  1000
    #  2 ** 6 = 64
    #  3 ** 4 = 81

    #  10 % 7 = 3
    #  3 % 2 =  1
    #  50 % 25 =  0
    #  14 % 11 = 3
    #  110 % 50 = 10

#5)კომენტარის სახით დაწერეთ თუ რაში ვიყენებთ სიებს,და რით განსხვავდებიან ისინი ცვლადებისაგან
# სიებს ვიყენებთ ელემენტების შესანახად და ცვლადსა და სიას შორის განსხვაავებაა მათში შენახული ელემენტების რაოდენობა 
# ანუ სია საშვალებას გვაძლევს რომ მასში რამდენიმე ელემენტი იყოს შენახული რაც შეეხება ცვლადს იგი მხოლოდ ერთი ელემენტის შენახვის უნარით შემოიფარგლება

#6)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ სტრინგ ტიპის მონაცემები
this_list = ["vaxo","lasha","dato","avto"]
#7)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ინტეჯერ ტიპის მონაცემები
this_list_1 = [10,20,30,40,50,]
#8)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ფლოატ ტიპის მონაცემები
this_list_2 = [45.5,32.3,34.5,57.65]
#9)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ boolean ტიპის მონაცემები
this_list_3 = [True,False]
#10)შექმენით სია,შეინახეთ ეს სია ცვლადში და ამ სიაში შეინახეთ ყველა მონაცემთა ტიპის მონაცემი
this_list_4= ["ვანო",10,10.5,True]

#11)მომხმარებელს შემოატანინეთ ორი რიცხვი და მოახდინეთ ამ ორ რიცხხვზე დღეს ნასწავლი მათემატიკური ოპერაციები(თან დაპრინტეთ რომ ნახოთ შედეგი)
user_inp = int(input("enter any number "))
print(user_inp ** 4)
user_inp_1 = int(input("enter any number"))
print(user_inp_1 // 5)
user_inp_2 = int(input("enter any number"))
print(user_inp_2 % 5)
# 12)მომხმარებელს შემოატანინეთ ინტეჯერ ტიპის მონაცემი, შემდეგ შეამოწმეთ, თუ მომხმარებლის შემოყვანილი რიცხვი არის 30 ზე მეტი და 100ზე ნაკლები დაუპრინტე --> "between 30 and 100", თუ ეს რიცხვი არის 100 ზე მეტი და 200 ზე ნაკლები დაუპრინტე --> "between 100 and 200" , სხვა დანარჩენ შემთხვევაში დაუპრინტე  --> "other number"
user_inp_3 = int(input("enter any number"))
if user_inp_3 > 30 and user_inp_3 < 100:
    print("between 30 and 100")
elif user_inp_3 > 100 and user_inp_3 < 200:
    print("between 100 and 200")
# 13)შექმენი 5 ცვლადი შეინახე განსხვავებული ტიპის მონაცემები და დაპრინტე მათი ტიპები(გამოიყენეტ ნასწავლი ფუნქცია)
var = "gela"
var_1 = 10
var_2 = 14.5
var_3 = True 
print(type(var))
print(type(var_1))
print(type(var_2))
print(type(var_3))

#14)while ციკლის დახმარებით გამოიტანეთ რიცხვები 50 დან 100 მდე 5 ის გამოტოვებით --> 50 55 60 ...
first_num = 50
while first_num <= 100:
    print(first_num)
    first_num += 5
# 15)for ციკლის დახმარებით გამოიტანეთ რიცხვები 40 დან 90 მდე 3 ის გამოტოვებით -- > 40 43 46 ...
for i in range(40,90,3):
    print(i)
# 16)გამოიტანე შენი სახელი და გვარი 15 ჯერ,გააკეთე ორივე ვარიანტით როგორც for ასევე while loop ის დახმარებით
for i in range(15):
    print(f"{i}nikoloz")

count = 0 
while count < 15:
    print("nikoloz")
    count += 1
# 17)
# შექმენი ცვლადი სადაც შეინახავ შენს სახელს
# შექმენი ცვლადი სადაც შეინახავ შენს გვარს
# მომხმარებელს შემოატანინეთ სახელი
# თუ მომხმარებელმა შემოიტანა იგივე სახელი რაც შენ გქვია მაშინ:
#       მომხმარებელს შემოატანინე გვარი
#       თუ მომხმარებლის შემოტანილი გვარი დაემთხვა შენს გვარს
#             დაპრინტე --> same name and surname
#       სხვა შემთხვევაში
#             დაპრინტე -- > same name but different surname
# სხვა შემთხვევაშში(ანუ თუ მომხმარებელი თავიდანვე შემოიყვანს არასწორ სახელს)
#     დაპრინტე --> aqedan moshordi
name = "nikoloz"
surname = "qusikashvili"
user_name = input("enter your name here: ")
user_surname = input("enter your surname here: ")
if  name == user_name and surname == user_surname:
    print("same name and surname")
elif name == user_name and surname != user_name:
    print("same name but different surname")
else:
    print("GET OUT!")

# HARDER(შეეცადეთ რომ ამოხსნათ თუ ვერ გამოვა შემდედგზე განვიხილავთ,მაინტერესებს დაძლევთ თუარა წესით უნდა გააკეთოთ!!!!!

# 18)
# შექმენი ცვლადი სადაც შეინახავ პაროლს
# მომხმარებელს შემოატანინე პაროლი
# სანამ პირობა არის ჭეშმარიტი(True)
#       თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#             დაპრინტე --> გამოიცანი
#              break
#       სხვა შემთხვევაში:
#           თავიდან გაუმეორე რომ შემოიყვანოს პაროლი
password = "legvi"
attempts = 0 
work = True
while work:
    user_inp_try = input("Enter your password: ")
    attempts +=1
    if  password == user_inp_try:
        print(f"your password was correct attempts used{attempts}")
        break
else:
    attempts +=1
    print(f"your password is incorrect current attempts = {attempts}")